# YOLOv9

# parameters
nc: 2  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3


# gelan backbone
backbone:
  [
   # conv down
   [-1, 1, Conv, [64, 3, 2]],  # 0-P1/2

   # conv down
   [-1, 1, Conv, [128, 3, 2, 2]],  # 1-P2/4

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  # 2

   # avg-conv down
   [-1, 1, ADown, [256]],  # 3-P3/8

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],  # 4

   # avg-conv down
   [-1, 1, ADown, [512]],  # 5-P4/16

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 6

   # avg-conv down
   [-1, 1, ADown, [512]],  # 7-P5/32

   [-1, 1, SPPF, [512, 5]],  # 8

   [-1, 1, SA_GELAN_FFT3, [512]], 
  ]

# gelan head
head:
  [
   [-1, 1, Conv, [512, 1, 1]],  # 10

   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 

   [[-1, 6], 1, Concat, [1]],  #  cat backbone P4

   [-1, 1, Conv, [512, 1, 1]], # 
   
   [-1, 1, MFE, [256]],  # 

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 

   [[-1, 4], 1, Concat, [1]],  #   cat backbone P3

   [-1, 1, DWConv, [512, 1, 1]], # 

   [-1, 1, MFE, [256]], #

   [-1, 3, RepC3, [256]],  # 19 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]], # 

   [[-1, 14], 1, Concat, [1]],  # 

   [-1, 1, MFE, [512]],  # 
   
   [-1, 3, RepC3, [512]],  # 23 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],  # 

   [[-1, 10], 1, Concat, [1]],  #  cat head P5

   [-1, 3, RepC3, [512]],   # 26 (P5/32-large)

   # detect
   [[19, 23, 26], 1, DDetect, [nc]],  # DDetect(P3, P4, P5)
  ]
